src/AccumulationRegisters/ДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредства</Name>
			<Comment>Денежные средства</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БанковскийСчетКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ДенежныеСредства/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

// Функция вернет остатко денежных средств по переданным параметрам
Функция ПолучитьОстаткоДенежныхСредств(Период = Неопределено
	                                  ,БанковскийСчетКасса  = Неопределено
									  ,НеУчитываемыйРегистратор = Неопределено) Экспорт
	
	  ЗапросВыборка = Новый Запрос(
	  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	  |	ДенежныеСредстваОбороты.БанковскийСчетКасса КАК Приемник,
	  |	ДенежныеСредстваОбороты.ТипДенежныхСредств КАК ТипДенежныхСредств,
	  |	СУММА(ДенежныеСредстваОбороты.СуммаОборот) КАК СуммаОстаток
	  |ИЗ
	  |	РегистрНакопления.ДенежныеСредства.Обороты(
	  |			,
	  |			&Период,
	  |			Авто,
	  |			ВЫБОР
	  |				КОГДА НЕ &Приемник = НЕОПРЕДЕЛЕНО
	  |					ТОГДА БанковскийСчетКасса = &Приемник
	  |				ИНАЧЕ ИСТИНА
	  |			КОНЕЦ) КАК ДенежныеСредстваОбороты
	  |ГДЕ
	  |	ВЫБОР
	  |			КОГДА НЕ &Регистратор = НЕОПРЕДЕЛЕНО
	  |				ТОГДА НЕ ДенежныеСредстваОбороты.Регистратор = &Регистратор
	  |			ИНАЧЕ ИСТИНА
	  |		КОНЕЦ
	  |
	  |СГРУППИРОВАТЬ ПО
	  |	ДенежныеСредстваОбороты.БанковскийСчетКасса,
	  |	ДенежныеСредстваОбороты.ТипДенежныхСредств");
	
	ЗапросВыборка.УстановитьПараметр("Период"             ,?(Период = Неопределено, Дата(0001,01,01,0,0,0),Период));
	ЗапросВыборка.УстановитьПараметр("Регистратор"        ,НеУчитываемыйРегистратор);
	ЗапросВыборка.УстановитьПараметр("Приемник"           ,БанковскийСчетКасса);
	
	Резвыборки = ЗапросВыборка.Выполнить().Выгрузить();
	
	Возврат Резвыборки.Итог("СуммаОстаток");
	
КонецФункции

#КонецОбласти
